app/controllers/haikus_controller.rb

  def create
    @haiku = Haiku.new params[:haiku]
    if @haiku.save
---
INSERT INTO `haikus` (`haiku_id`, `line1`, `line2`, `line3`, `composer_id`, `created_at`) VALUES(NULL, 'one two three', 'two three four seven', 'three four five', NULL, '2009-07-12 10:08:24')